<?php

$array[ 'RentFromOwner' ] = array(
  "اجاره مستقیم از مالک بدون دردسر",
  "اجاره مستقیم از مالک",
  "اجاره از مالک بدون واسطه",
  "اجاره از مرکز معتبر و خوشنام",
  "مالک هستم واسطه نیستم",
  "تمامی خودروها بنام میباشد",
  "تمامی خودروها بنام میباشد (رویت برگ سبز خودرو)",
  "خودرو به مالکیت موسسه میباشد",
  "اجاره از موسسه ایی معتبر با مجوز رسمی و ثبت شده",
  "اجاره مستقیم از مالک به مشتری",
  "تنظیم قرارداد مستقیم با مالک",
  "",
);
$array[ 'Slogan' ] = array(
  "با خیال راحت اجاره کنید!",
  "از مراکز معتبر اجاره کنید",
  "دفتر معتبر اجاره خودرو",
  "داراى سابقه کارى درخشان",
 // "داراى {{ResmuneYear}} سابقه کارى درخشان",
  "هیچ ارزانی بی علت نسیت!",
  "سالهاست با شماییم!",
  "تجربه ایی نو، لذت رانندگی با برترین ها!",
  "",
);
$array[ 'Sep1' ] = array(
  "######################",
  "**********************",
  "^^^^^^^^^^^^^^^^^^^^^",
  "@@@@@@@@@@@@@@@",
  "$$$$$$$$$$$$$$$$$",
  "%%%%%%%%%%%%%%%%%%",
  "&&&&&&&&&&&&&&&&&&&",
  "____________________",
  "--------------------",
  "--------------------",
  "====================",
  "",
);
$array[ 'CarName' ] = array(
  "اجاره خودرو {{BrandNameFa}} {{CarNameFa}} مدل {{Year}}",
  "اجاره خودرو {{BrandNameFa}} {{CarNameFa2}} مدل {{Year}}",
  "اجاره خودرو {{BrandNameFa}} {{CarNameEn}} مدل {{Year}}",
  "اجاره خودرو {{BrandNameFa}} {{CarNameFa}} {{Year}}",
  "اجاره خودرو {{BrandNameFa}} {{CarNameFa2}} {{Year}}",
  "اجاره خودرو {{BrandNameFa}} {{CarNameEn}} {{Year}}",
  "اجاره خودرو {{BrandNameFa}} {{CarNameFa}}",
  "اجاره خودرو {{BrandNameFa}} {{CarNameFa2}}",
  "اجاره خودرو {{BrandNameFa}} {{CarNameEn}}",
  "",
  "",
  "",
  "",
  "",
  "",
  "",
  "",
  "",
  "",
  "",
  "",
);

$array[ 'Terms' ] = array(
  "با شرایط آسان چک یا سفته",
  "با شرایط آسان بدون چک",
  "با شرایط آسان بدون نیاز به مدارک شغلی",
  "ضمانت:خودرو ایرانی بزارید خارجی ببرید ",
  "شرایط اسان",
  "شرایط اسان بدون دردسر",
  "",
);
$array[ 'Permission' ] = array(
  "با مجوز رسمی و عقد قرارداد",
  "با مجوز رسمی و عقد قرارداد اجاره خودرو",
  "با مجوز رسمی و کد",
  "تنظیم قرارداد رسمی",
  "تنظیم قرارداد اجاره خودرو رسمی",
  "تنظیم قرارداد رسمی",
  "",
  "",
  "",
  "",
);
$array[ 'Delivery' ] = array(
  "عقد قرارداد در موسسه معتبر",
  "عقد قرارداد رسمی داخل دفتر",
  "عقد قرارداد در دفتر اجاره خودرو نه در نمایشگاه و شخص",
  "",
  "",
  "",
  "",
);
$array[ 'Delivery' ] = array(
  "تحویل به صورت ۲۴ ساعته ",
  "تحویل در تمام ساعات شبانه روز ",
  "تحویل فوری یک ساعته",
  "ارسال به تمام نقاط ایران",
  "ارسال خودرو به تمام نقاط ایران",
  "تحویل تهران وشهرستان",
  "تحویل در محل (کار یا منزل) شما یا دفتر اجاره خودرو",
  "",
  "",
  "",
  "",
);
$array[ 'Insurance' ] = array(
  "بیمه بدنه و شخص ثالث",
  "بیمه فول با تمام پوشش ها",
  "بیمه شخص ثالث و بدنه فول با تمام پوشش ها",
  "بیمه بدنه و ثالث تکمیل ",
  "بیمه بدنه و شخص ثالث بدون هزینه اضافه",
  "بیمه فول با تمام پوشش ها بدون هزینه اضافه",
  "بیمه شخص ثالث و بدنه فول با تمام پوشش ها بدون هزینه اضافه",
  "بیمه بدنه و ثالث تکمیل بدون پرداخت هزینه",
  "",
  "",
  "",
  "",
  "",
  "",
);


$array[ 'MinimumDays' ] = array(
  "حداقل مدت زمان اجاره {{MinimumDays}} روز می باشد",
  "حداقل {{MinimumDays}} روز اجاره داده می شود",
  "",
  "",
  "",
  "",
);


$array[ 'MileageLimit' ] = array(
  "تردد مجاز روزانه {{MileageLimit}} کیلومتر به صورت میانگین",
  "به صورت میانگین مجاز به تردد روزانه {{MileageLimit}} می باشید",
  "کیلومتر مجاز روزانه {{MileageLimit}}",
  "",
  "",
  "",
  "",
  "",
);


$array[ 'OutOfCity' ] = array(
  "امکان خروج از شهر",
  "امکان خروج از شهر با اطلاع موسسه",
  "امکان خروج از شهر با هماهنگی",
  "",
  "",
  "",
  "",
);

$array[ 'CheckUp' ] = array(
  "فنی و بدنه کاملا سالم و تمیز",
  "فنی و بدنه خودرو کاملا سالم و تمیز",
  "کارشناسی و چک آپ شده",
  "تمامی خودرو ها قبل از تحویل کارشناسی و چک آپ شده تحویل می شود",
  "کارشناسی رنگ و چک آپ و کارشناسی فنی شده",
  "",
  "",
  "",
  "",
  "",
);
$array[ 'Contract' ] = array(
  "اجاره به صورت روزانه هفتگی ماهانه",
  "اجاره کوتاه مدت و بلند مدت",
  "روزانه ماهانه سالانه",
  "روز، هفته، ماه، سال",
  "",
  "",
  "",
  "",
);
$array[ 'Off' ] = array(
  "** ماه ببر تخفیف بگیر **",
  "تخفیف ویژه اجاره ماهیانه",
  "تخفیف ویژه اجاره بالای یک هفته",
  //"{{PriceWeekPercent}} تخفیف اجاره یک هفته به بالا",
  //"{{PriceMonthPercent}} تخفیف اجاره یک ماه به بالا",
  "در صورت اجاره ماهیانه تخفیف داده میشود",
  "",
  "",
  "",
  "",
  "",
);
$array[ 'Sep2' ] = array(
  "######################",
  "**********************",
  "^^^^^^^^^^^^^^^^^^^^^",
  "@@@@@@@@@@@@@@@",
  "$$$$$$$$$$$$$$$$$",
  "%%%%%%%%%%%%%%%%%%",
  "&&&&&&&&&&&&&&&&&&&",
  "____________________",
  "--------------------",
  "--------------------",
  "====================",
  "",
  "",
  "",
  "",
  "",
);

$array[ 'Contact' ] = array(
  "برای اطلاع بیشتر تماس بگیرید",
  "چت و پیامک پاسخگو نیستم تماس بگیرید",
  "جهت اطلاع از موجودی و رزرو خودرو دیگر تماس بگیرید",
  "جهت کسب اطلاعات کامل تماس بگیرید",
  "جهت مشاوره و رزرو تماس بگیرید",
  "فقط تماس بگیرید چت و پیامک پاسخگو نیستم",
  //"",

);
$ReplaceOneWords = array(
  array( 'اجاره', 'کرایه', 'رنت' ),
  array( 'خودرو', 'ماشین', 'اتومبیل' ),
  array( 'ودیعه' , 'ودیعه نقدی' ),
  array( 'تماس بگیرید' , 'زنگ بزنید' ),
  array( 'پیامک' , 'اس ام اس' ),
);


//echo $Desc;
foreach ( $array as $section => $Sentences ) {
  foreach ( $Sentences as $Sentence ) {
    foreach ( $ReplaceOneWords as $ReplaceOneWordArr ) {
      foreach ( $ReplaceOneWordArr as $k => $ReplaceOneWord ) {
		  $ToReplaceOneWordArr = $ReplaceOneWordArr;
		  unset($ToReplaceOneWordArr[$k]);
		  foreach($ToReplaceOneWordArr as $ToReplaceOneWord){
			$NewSentence = str_replace( $ReplaceOneWord, $ToReplaceOneWord, $Sentence );
			if ( $NewSentence != $Sentence ) {
			  $array[ $section ][] = str_replace( $ReplaceOneWord, $ToReplaceOneWord, $NewSentence );
			}
		  }
      }
    }
  }
}
/*
echo '<pre>';
var_dump( $array);
echo '</pre>';
*/
//$Desc = '';

foreach ( $array as $SentenceArray ) {
  shuffle( $SentenceArray );
	if($SentenceArray[ 0 ]!=''){
  $Desc[]= $SentenceArray[ 0 ] . '
';
	}
}
  shuffle( $Desc );
$Desc = implode('',$Desc );
//echo iconv('UTF-16', 'UTF-8', $Desc);
//echo '<pre>';
echo ($Desc);
//echo '</pre>';

/*
array('اجاره اتومبیل مستقیم', 'رنت ماشین مستقیم', 'رنت خودرو مستقیم', 'اجاره اتومبیل مستقیم', 'اجاره ماشین مستقیم', 'اجاره خودرو مستقیم', ),
); 
*/